/* Задача 2. Напишете функцията int atof(char *s), която
преобразува стринг в число с десетична запетая. Тази функция е
подобна на разглежданата по-горе atoi(char *s), само че когато се
стигне до. точката, отделяща цялата част от дробната, трябва
да се пусне още един цикъл, който да изчисли числото в
дробната част по същия начин, както е числото в цялата част.
Само че тук при дробната част трябва да имаме една
променлива, която да умножаваме по 10 всеки път до края на
дробната част power *= 10; Накрая трябва да разделим
полученото число на тази променлива, за да получим реалното
число с плаващата заперая на точното място. */
#include <stdio.h>

void task2(void);
double atof(char *s);

int main(void){
    task2();
    
    return 0;
}

void task2() {
	char s[] = "123.14";
    printf("%lf\n", atof(s));
    return;
}

double atof(char *s){
    char flag = 0;
    int i = -1;
    double result = 0, power = 1;

	while (s[++i] != '\0') {
		if (s[i] == '.') {
			flag = 1;
			continue;
		}
		
		if (s[i] >= '0' || s[i] <= '9')
			if (flag == 0)
				result = result * 10 + (s[i] - '0');
			else {
				result = result * 10 + (s[i] - '0');
				power *= 10;
			}
	}

    return result / power;
}
